espressif/esp-idf/components/soc/esp32c6/register/soc/apb_saradc_struct.h
/** Type of saradc_filter_ctrl0 register
 *  digital saradc configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:18;
        /** saradc_apb_saradc_filter_channel1 : R/W; bitpos: [21:18]; default: 13;
         *  configure filter1 to adc channel
         */
        uint32_t saradc_apb_saradc_filter_channel1:4;
        /** saradc_apb_saradc_filter_channel0 : R/W; bitpos: [25:22]; default: 13;
         *  configure filter0 to adc channel
         */
        uint32_t saradc_apb_saradc_filter_channel0:4;
        uint32_t reserved_26:5;
        /** saradc_apb_saradc_filter_reset : R/W; bitpos: [31]; default: 0;
         *  enable apb_adc1_filter
         */
        uint32_t saradc_apb_saradc_filter_reset:1;
    };
    uint32_t val;
} apb_saradc_filter_ctrl0_reg_t;

/** Type of saradc_sar1data_status register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_apb_saradc1_data : RO; bitpos: [16:0]; default: 0;
         *  saradc1 data
         */
        uint32_t saradc_apb_saradc1_data:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} apb_saradc_sar1data_status_reg_t;

/** Type of saradc_sar2data_status register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_apb_saradc2_data : RO; bitpos: [16:0]; default: 0;
         *  saradc2 data
         */
        uint32_t saradc_apb_saradc2_data:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} apb_saradc_sar2data_status_reg_t;

/** Type of saradc_thres0_ctrl register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_apb_saradc_thres0_channel : R/W; bitpos: [3:0]; default: 13;
         *  configure thres0 to adc channel
         */
        uint32_t saradc_apb_saradc_thres0_channel:4;
        uint32_t reserved_4:1;
        /** saradc_apb_saradc_thres0_high : R/W; bitpos: [17:5]; default: 8191;
         *  saradc thres0 monitor thres
         */
        uint32_t saradc_apb_saradc_thres0_high:13;
        /** saradc_apb_saradc_thres0_low : R/W; bitpos: [30:18]; default: 0;
         *  saradc thres0 monitor thres
         */
        uint32_t saradc_apb_saradc_thres0_low:13;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} apb_saradc_thres0_ctrl_reg_t;

/** Type of saradc_thres1_ctrl register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_apb_saradc_thres1_channel : R/W; bitpos: [3:0]; default: 13;
         *  configure thres1 to adc channel
         */
        uint32_t saradc_apb_saradc_thres1_channel:4;
        uint32_t reserved_4:1;
        /** saradc_apb_saradc_thres1_high : R/W; bitpos: [17:5]; default: 8191;
         *  saradc thres1 monitor thres
         */
        uint32_t saradc_apb_saradc_thres1_high:13;
        /** saradc_apb_saradc_thres1_low : R/W; bitpos: [30:18]; default: 0;
         *  saradc thres1 monitor thres
         */
        uint32_t saradc_apb_saradc_thres1_low:13;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} apb_saradc_thres1_ctrl_reg_t;

/** Type of saradc_thres_ctrl register
 *  digital saradc configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:27;
        /** saradc_apb_saradc_thres_all_en : R/W; bitpos: [27]; default: 0;
         *  enable thres to all channel
         */
        uint32_t saradc_apb_saradc_thres_all_en:1;
        uint32_t reserved_28:2;
        /** saradc_apb_saradc_thres1_en : R/W; bitpos: [30]; default: 0;
         *  enable thres1
         */
        uint32_t saradc_apb_saradc_thres1_en:1;
        /** saradc_apb_saradc_thres0_en : R/W; bitpos: [31]; default: 0;
         *  enable thres0
         */
        uint32_t saradc_apb_saradc_thres0_en:1;
    };
    uint32_t val;
} apb_saradc_thres_ctrl_reg_t;

/** Type of saradc_int_ena register
 *  digital saradc int register
 */
typedef union {
    struct {
        uint32_t reserved_0:25;
        /** saradc_apb_saradc_tsens_int_ena : R/W; bitpos: [25]; default: 0;
         *  tsens low  interrupt enable
         */
        uint32_t saradc_apb_saradc_tsens_int_ena:1;
        /** saradc_apb_saradc_thres1_low_int_ena : R/W; bitpos: [26]; default: 0;
         *  saradc thres1 low  interrupt enable
         */
        uint32_t saradc_apb_saradc_thres1_low_int_ena:1;
        /** saradc_apb_saradc_thres0_low_int_ena : R/W; bitpos: [27]; default: 0;
         *  saradc thres0 low interrupt enable
         */
        uint32_t saradc_apb_saradc_thres0_low_int_ena:1;
        /** saradc_apb_saradc_thres1_high_int_ena : R/W; bitpos: [28]; default: 0;
         *  saradc thres1 high interrupt enable
         */
        uint32_t saradc_apb_saradc_thres1_high_int_ena:1;
        /** saradc_apb_saradc_thres0_high_int_ena : R/W; bitpos: [29]; default: 0;
         *  saradc thres0 high interrupt enable
         */
        uint32_t saradc_apb_saradc_thres0_high_int_ena:1;
        /** saradc_apb_saradc2_done_int_ena : R/W; bitpos: [30]; default: 0;
         *  saradc2 done interrupt enable
         */
        uint32_t saradc_apb_saradc2_done_int_ena:1;
        /** saradc_apb_saradc1_done_int_ena : R/W; bitpos: [31]; default: 0;
         *  saradc1 done interrupt enable
         */
        uint32_t saradc_apb_saradc1_done_int_ena:1;
    };
    uint32_t val;
} apb_saradc_int_ena_reg_t;

/** Type of saradc_int_raw register
 *  digital saradc int register
 */
typedef union {
    struct {
        uint32_t reserved_0:25;
        /** saradc_apb_saradc_tsens_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  saradc tsens  interrupt raw
         */
        uint32_t saradc_apb_saradc_tsens_int_raw:1;
        /** saradc_apb_saradc_thres1_low_int_raw : R/WTC/SS; bitpos: [26]; default: 0;
         *  saradc thres1 low  interrupt raw
         */
        uint32_t saradc_apb_saradc_thres1_low_int_raw:1;
        /** saradc_apb_saradc_thres0_low_int_raw : R/WTC/SS; bitpos: [27]; default: 0;
         *  saradc thres0 low interrupt raw
         */
        uint32_t saradc_apb_saradc_thres0_low_int_raw:1;
        /** saradc_apb_saradc_thres1_high_int_raw : R/WTC/SS; bitpos: [28]; default: 0;
         *  saradc thres1 high interrupt raw
         */
        uint32_t saradc_apb_saradc_thres1_high_int_raw:1;
        /** saradc_apb_saradc_thres0_high_int_raw : R/WTC/SS; bitpos: [29]; default: 0;
         *  saradc thres0 high interrupt raw
         */
        uint32_t saradc_apb_saradc_thres0_high_int_raw:1;
        /** saradc_apb_saradc2_done_int_raw : R/WTC/SS; bitpos: [30]; default: 0;
         *  saradc2 done interrupt raw
         */
        uint32_t saradc_apb_saradc2_done_int_raw:1;
        /** saradc_apb_saradc1_done_int_raw : R/WTC/SS; bitpos: [31]; default: 0;
         *  saradc1 done interrupt raw
         */
        uint32_t saradc_apb_saradc1_done_int_raw:1;
    };
    uint32_t val;
} apb_saradc_int_raw_reg_t;

